tutorials/buoyantBoussinesqPiso4PCMFoam/rectangularPCM/constant/tables/TempvsTime
(
    (0 330)
    (4800 343)
)
