tutorials/buoyantBoussinesqPiso4PCMFoam/rectangularPCM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    right
    {
        type            timeVaryingUniformFixedValue;
        fileName        "$FOAM_CASE/constant/tables/TempvsTime";
        outOfBounds     clamp;           // (error|warn|clamp|repeat)
    }

    ".*"
    {
	type		zeroGradient;
    }
}

// ************************************************************************* //
